#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.infrastructure.module.iam.google_service_account.worker: Refreshing state... [id=projects/breatheroute/serviceAccounts/breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.iam.google_service_account.api: Refreshing state... [id=projects/breatheroute/serviceAccounts/breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.google_project_service.apis["run.googleapis.com"]: Refreshing state... [id=breatheroute/run.googleapis.com]
module.infrastructure.google_project_service.apis["cloudtrace.googleapis.com"]: Refreshing state... [id=breatheroute/cloudtrace.googleapis.com]
module.infrastructure.google_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=breatheroute/iam.googleapis.com]
module.infrastructure.google_project_service.apis["pubsub.googleapis.com"]: Refreshing state... [id=breatheroute/pubsub.googleapis.com]
module.infrastructure.google_project_service.apis["vpcaccess.googleapis.com"]: Refreshing state... [id=breatheroute/vpcaccess.googleapis.com]
module.infrastructure.google_project_service.apis["monitoring.googleapis.com"]: Refreshing state... [id=breatheroute/monitoring.googleapis.com]
module.infrastructure.google_project_service.apis["secretmanager.googleapis.com"]: Refreshing state... [id=breatheroute/secretmanager.googleapis.com]
module.infrastructure.google_project_service.apis["logging.googleapis.com"]: Refreshing state... [id=breatheroute/logging.googleapis.com]
module.infrastructure.google_project_service.apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=breatheroute/cloudresourcemanager.googleapis.com]
module.infrastructure.google_project_service.apis["servicenetworking.googleapis.com"]: Refreshing state... [id=breatheroute/servicenetworking.googleapis.com]
module.infrastructure.google_project_service.apis["redis.googleapis.com"]: Refreshing state... [id=breatheroute/redis.googleapis.com]
module.infrastructure.google_project_service.apis["sqladmin.googleapis.com"]: Refreshing state... [id=breatheroute/sqladmin.googleapis.com]
module.infrastructure.google_project_service.apis["artifactregistry.googleapis.com"]: Refreshing state... [id=breatheroute/artifactregistry.googleapis.com]
module.infrastructure.google_project_service.apis["cloudscheduler.googleapis.com"]: Refreshing state... [id=breatheroute/cloudscheduler.googleapis.com]
module.infrastructure.module.pubsub.google_pubsub_topic.alert_evaluation: Refreshing state... [id=projects/breatheroute/topics/breatheroute-prod-alert-evaluation]
module.infrastructure.module.networking.google_compute_network.main: Refreshing state... [id=projects/breatheroute/global/networks/breatheroute-prod-vpc]
module.infrastructure.module.pubsub.google_pubsub_topic.provider_refresh: Refreshing state... [id=projects/breatheroute/topics/breatheroute-prod-provider-refresh]
module.infrastructure.module.pubsub.google_pubsub_topic.dead_letter: Refreshing state... [id=projects/breatheroute/topics/breatheroute-prod-dead-letter]
module.infrastructure.module.pubsub.google_pubsub_topic.gdpr_export: Refreshing state... [id=projects/breatheroute/topics/breatheroute-prod-gdpr-export]
module.infrastructure.module.secrets.google_secret_manager_secret.jwt_signing_key: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-jwt-signing-key]
module.infrastructure.module.pubsub.google_pubsub_topic.webhook_delivery: Refreshing state... [id=projects/breatheroute/topics/breatheroute-prod-webhook-delivery]
module.infrastructure.module.secrets.google_secret_manager_secret.luchtmeetnet_api_key: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-luchtmeetnet-api-key]
module.infrastructure.module.pubsub.google_pubsub_topic.gdpr_deletion: Refreshing state... [id=projects/breatheroute/topics/breatheroute-prod-gdpr-deletion]
module.infrastructure.module.secrets.google_secret_manager_secret.ns_api_key: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-ns-api-key]
module.infrastructure.module.secrets.google_secret_manager_secret.apns_key: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-apns-key]
module.infrastructure.module.secrets.google_secret_manager_secret.webhook_signing_secret: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-webhook-signing-secret]
module.infrastructure.module.secrets.google_secret_manager_secret.db_password: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-db-password]
module.infrastructure.module.secrets.google_secret_manager_secret.pollen_api_key: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-pollen-api-key]
module.infrastructure.module.pubsub.google_pubsub_subscription.dead_letter: Refreshing state... [id=projects/breatheroute/subscriptions/breatheroute-prod-dead-letter-sub]
module.infrastructure.module.pubsub.google_pubsub_subscription.alert_evaluation: Refreshing state... [id=projects/breatheroute/subscriptions/breatheroute-prod-alert-evaluation-sub]
module.infrastructure.module.pubsub.google_pubsub_subscription.provider_refresh: Refreshing state... [id=projects/breatheroute/subscriptions/breatheroute-prod-provider-refresh-sub]
module.infrastructure.module.networking.google_compute_firewall.allow_health_checks: Refreshing state... [id=projects/breatheroute/global/firewalls/breatheroute-prod-allow-health-checks]
module.infrastructure.module.networking.google_compute_firewall.allow_internal: Refreshing state... [id=projects/breatheroute/global/firewalls/breatheroute-prod-allow-internal]
module.infrastructure.module.networking.google_compute_global_address.private_ip_range: Refreshing state... [id=projects/breatheroute/global/addresses/breatheroute-prod-private-ip-range]
module.infrastructure.module.networking.google_compute_subnetwork.main: Refreshing state... [id=projects/breatheroute/regions/europe-west4/subnetworks/breatheroute-prod-subnet]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.infrastructure.google_artifact_registry_repository.containers will be created
  + resource "google_artifact_registry_repository" "containers" {
      + create_time      = (known after apply)
      + description      = "BreatheRoute container images"
      + effective_labels = {
          + "app"         = "breatheroute"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + labels           = {
          + "app"         = "breatheroute"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + location         = "europe-west4"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "breatheroute"
      + repository_id    = "breatheroute"
      + terraform_labels = {
          + "app"         = "breatheroute"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + update_time      = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-old-untagged"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "UNTAGGED"
              + version_name_prefixes = []
            }
        }
      + cleanup_policies {
          + action = "KEEP"
          + id     = "keep-recent"

          + most_recent_versions {
              + keep_count            = 10
              + package_name_prefixes = []
            }
        }
    }

  # module.infrastructure.module.cloud_run_api.google_cloud_run_v2_service.main will be created
  + resource "google_cloud_run_v2_service" "main" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "europe-west4"
      + name                    = "breatheroute-prod-api"
      + observed_generation     = (known after apply)
      + project                 = "breatheroute"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + labels                           = {
              + "app"         = "breatheroute"
              + "environment" = "prod"
              + "managed_by"  = "terraform"
            }
          + max_instance_request_concurrency = 80
          + service_account                  = "breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com"
          + timeout                          = "300s"

          + containers {
              + image = "gcr.io/cloudrun/hello"

              + env {
                  + name  = "DB_HOST"
                  + value = (sensitive value)
                }
              + env {
                  + name  = "DB_NAME"
                  + value = "breatheroute"
                }
              + env {
                  + name  = "DB_PORT"
                  + value = "5432"
                }
              + env {
                  + name  = "ENVIRONMENT"
                  + value = "prod"
                }
              + env {
                  + name  = "GCP_PROJECT"
                  + value = "breatheroute"
                }
              + env {
                  + name  = "PUBSUB_PROJECT"
                  + value = "breatheroute"
                }
              + env {
                  + name  = "REDIS_HOST"
                  + value = (known after apply)
                }
              + env {
                  + name  = "REDIS_PORT"
                  + value = (known after apply)
                }
              + env {
                  + name = "DB_PASSWORD"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "breatheroute-prod-db-password"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "JWT_SIGNING_KEY"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "breatheroute-prod-jwt-signing-key"
                          + version = "latest"
                        }
                    }
                }

              + liveness_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 0
                  + period_seconds        = 30
                  + timeout_seconds       = 3

                  + http_get {
                      + path = "/v1/ops/health"
                      + port = 8080
                    }
                }

              + ports {
                  + container_port = 8080
                  + name           = "http1"
                }

              + resources {
                  + cpu_idle          = true
                  + limits            = {
                      + "cpu"    = "2"
                      + "memory" = "1Gi"
                    }
                  + startup_cpu_boost = true
                }

              + startup_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 5
                  + period_seconds        = 10
                  + timeout_seconds       = 3

                  + http_get {
                      + path = "/v1/ops/health"
                      + port = 8080
                    }
                }
            }

          + scaling {
              + max_instance_count = 20
              + min_instance_count = 1
            }

          + vpc_access {
              + connector = (known after apply)
              + egress    = "PRIVATE_RANGES_ONLY"
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # module.infrastructure.module.cloud_run_api.google_cloud_run_v2_service_iam_member.public[0] will be created
  + resource "google_cloud_run_v2_service_iam_member" "public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west4"
      + member   = "allUsers"
      + name     = "breatheroute-prod-api"
      + project  = "breatheroute"
      + role     = "roles/run.invoker"
    }

  # module.infrastructure.module.cloud_run_worker.google_cloud_run_v2_service.main will be created
  + resource "google_cloud_run_v2_service" "main" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_INTERNAL_ONLY"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "europe-west4"
      + name                    = "breatheroute-prod-worker"
      + observed_generation     = (known after apply)
      + project                 = "breatheroute"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + labels                           = {
              + "app"         = "breatheroute"
              + "environment" = "prod"
              + "managed_by"  = "terraform"
            }
          + max_instance_request_concurrency = 80
          + service_account                  = "breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com"
          + timeout                          = "300s"

          + containers {
              + image = "gcr.io/cloudrun/hello"

              + env {
                  + name  = "DB_HOST"
                  + value = (sensitive value)
                }
              + env {
                  + name  = "DB_NAME"
                  + value = "breatheroute"
                }
              + env {
                  + name  = "DB_PORT"
                  + value = "5432"
                }
              + env {
                  + name  = "ENVIRONMENT"
                  + value = "prod"
                }
              + env {
                  + name  = "GCP_PROJECT"
                  + value = "breatheroute"
                }
              + env {
                  + name  = "PUBSUB_PROJECT"
                  + value = "breatheroute"
                }
              + env {
                  + name  = "REDIS_HOST"
                  + value = (known after apply)
                }
              + env {
                  + name  = "REDIS_PORT"
                  + value = (known after apply)
                }
              + env {
                  + name = "APNS_KEY"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "breatheroute-prod-apns-key"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "DB_PASSWORD"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "breatheroute-prod-db-password"
                          + version = "latest"
                        }
                    }
                }

              + liveness_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 0
                  + period_seconds        = 30
                  + timeout_seconds       = 3

                  + http_get {
                      + path = "/v1/ops/health"
                      + port = 8080
                    }
                }

              + ports {
                  + container_port = 8080
                  + name           = "http1"
                }

              + resources {
                  + cpu_idle          = true
                  + limits            = {
                      + "cpu"    = "2"
                      + "memory" = "1Gi"
                    }
                  + startup_cpu_boost = true
                }

              + startup_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 5
                  + period_seconds        = 10
                  + timeout_seconds       = 3

                  + http_get {
                      + path = "/v1/ops/health"
                      + port = 8080
                    }
                }
            }

          + scaling {
              + max_instance_count = 5
              + min_instance_count = 0
            }

          + vpc_access {
              + connector = (known after apply)
              + egress    = "PRIVATE_RANGES_ONLY"
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # module.infrastructure.module.cloud_sql.google_sql_database.app will be created
  + resource "google_sql_database" "app" {
      + charset         = (known after apply)
      + collation       = (known after apply)
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = (known after apply)
      + name            = "breatheroute"
      + project         = "breatheroute"
      + self_link       = (known after apply)
    }

  # module.infrastructure.module.cloud_sql.google_sql_database_instance.main will be created
  + resource "google_sql_database_instance" "main" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_15"
      + deletion_protection            = false
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = (known after apply)
      + private_ip_address             = (known after apply)
      + project                        = "breatheroute"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "europe-west4"
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "REGIONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = 50
          + disk_type             = "PD_SSD"
          + edition               = "ENTERPRISE"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-custom-2-4096"
          + user_labels           = {
              + "app"         = "breatheroute"
              + "environment" = "prod"
              + "managed_by"  = "terraform"
            }
          + version               = (known after apply)

          + backup_configuration {
              + enabled                        = true
              + location                       = "europe-west4"
              + point_in_time_recovery_enabled = true
              + start_time                     = "03:00"
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings {
                  + retained_backups = 7
                  + retention_unit   = "COUNT"
                }
            }

          + database_flags {
              + name  = "log_checkpoints"
              + value = "on"
            }
          + database_flags {
              + name  = "log_connections"
              + value = "on"
            }
          + database_flags {
              + name  = "log_disconnections"
              + value = "on"
            }
          + database_flags {
              + name  = "log_lock_waits"
              + value = "on"
            }

          + insights_config {
              + query_insights_enabled  = true
              + query_plans_per_minute  = (known after apply)
              + query_string_length     = 1024
              + record_application_tags = true
              + record_client_address   = false
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = "https://www.googleapis.com/compute/v1/projects/breatheroute/global/networks/breatheroute-prod-vpc"
              + server_ca_mode  = (known after apply)
              + ssl_mode        = (known after apply)
            }

          + maintenance_window {
              + day          = 7
              + hour         = 4
              + update_track = "stable"
            }
        }
    }

  # module.infrastructure.module.cloud_sql.google_sql_user.app will be created
  + resource "google_sql_user" "app" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = (known after apply)
      + name                    = "breatheroute_app"
      + password                = (sensitive value)
      + project                 = "breatheroute"
      + sql_server_user_details = (known after apply)
    }

  # module.infrastructure.module.cloud_sql.google_sql_user.migrations will be created
  + resource "google_sql_user" "migrations" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = (known after apply)
      + name                    = "breatheroute_migrations"
      + password                = (sensitive value)
      + project                 = "breatheroute"
      + sql_server_user_details = (known after apply)
    }

  # module.infrastructure.module.cloud_sql.random_id.db_suffix will be created
  + resource "random_id" "db_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.infrastructure.module.cloud_sql.random_password.db_password will be created
  + resource "random_password" "db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.infrastructure.module.cloud_sql.random_password.migrations_password will be created
  + resource "random_password" "migrations_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.infrastructure.module.iam.google_project_iam_member.api_logging_writer will be created
  + resource "google_project_iam_member" "api_logging_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com"
      + project = "breatheroute"
      + role    = "roles/logging.logWriter"
    }

  # module.infrastructure.module.iam.google_project_iam_member.api_monitoring_writer will be created
  + resource "google_project_iam_member" "api_monitoring_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com"
      + project = "breatheroute"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.infrastructure.module.iam.google_project_iam_member.api_pubsub_publisher will be created
  + resource "google_project_iam_member" "api_pubsub_publisher" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com"
      + project = "breatheroute"
      + role    = "roles/pubsub.publisher"
    }

  # module.infrastructure.module.iam.google_project_iam_member.api_secret_accessor will be created
  + resource "google_project_iam_member" "api_secret_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com"
      + project = "breatheroute"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.infrastructure.module.iam.google_project_iam_member.api_sql_client will be created
  + resource "google_project_iam_member" "api_sql_client" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com"
      + project = "breatheroute"
      + role    = "roles/cloudsql.client"
    }

  # module.infrastructure.module.iam.google_project_iam_member.api_trace_agent will be created
  + resource "google_project_iam_member" "api_trace_agent" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com"
      + project = "breatheroute"
      + role    = "roles/cloudtrace.agent"
    }

  # module.infrastructure.module.iam.google_project_iam_member.worker_logging_writer will be created
  + resource "google_project_iam_member" "worker_logging_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com"
      + project = "breatheroute"
      + role    = "roles/logging.logWriter"
    }

  # module.infrastructure.module.iam.google_project_iam_member.worker_monitoring_writer will be created
  + resource "google_project_iam_member" "worker_monitoring_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com"
      + project = "breatheroute"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.infrastructure.module.iam.google_project_iam_member.worker_pubsub_publisher will be created
  + resource "google_project_iam_member" "worker_pubsub_publisher" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com"
      + project = "breatheroute"
      + role    = "roles/pubsub.publisher"
    }

  # module.infrastructure.module.iam.google_project_iam_member.worker_pubsub_subscriber will be created
  + resource "google_project_iam_member" "worker_pubsub_subscriber" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com"
      + project = "breatheroute"
      + role    = "roles/pubsub.subscriber"
    }

  # module.infrastructure.module.iam.google_project_iam_member.worker_secret_accessor will be created
  + resource "google_project_iam_member" "worker_secret_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com"
      + project = "breatheroute"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.infrastructure.module.iam.google_project_iam_member.worker_sql_client will be created
  + resource "google_project_iam_member" "worker_sql_client" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com"
      + project = "breatheroute"
      + role    = "roles/cloudsql.client"
    }

  # module.infrastructure.module.iam.google_project_iam_member.worker_trace_agent will be created
  + resource "google_project_iam_member" "worker_trace_agent" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com"
      + project = "breatheroute"
      + role    = "roles/cloudtrace.agent"
    }

  # module.infrastructure.module.networking.google_service_networking_connection.private_vpc_connection will be created
  + resource "google_service_networking_connection" "private_vpc_connection" {
      + id                      = (known after apply)
      + network                 = "projects/breatheroute/global/networks/breatheroute-prod-vpc"
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "breatheroute-prod-private-ip-range",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

  # module.infrastructure.module.networking.google_vpc_access_connector.connector will be created
  + resource "google_vpc_access_connector" "connector" {
      + connected_projects = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "10.8.0.0/28"
      + machine_type       = "e2-micro"
      + max_instances      = 3
      + max_throughput     = 300
      + min_instances      = 2
      + min_throughput     = 200
      + name               = "prod-vpc-conn"
      + network            = "breatheroute-prod-vpc"
      + project            = "breatheroute"
      + region             = "europe-west4"
      + self_link          = (known after apply)
      + state              = (known after apply)
    }

  # module.infrastructure.module.pubsub.google_pubsub_subscription.gdpr_deletion will be created
  + resource "google_pubsub_subscription" "gdpr_deletion" {
      + ack_deadline_seconds       = 600
      + effective_labels           = {
          + "app"         = "breatheroute"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + id                         = (known after apply)
      + labels                     = {
          + "app"         = "breatheroute"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + message_retention_duration = "86400s"
      + name                       = "breatheroute-prod-gdpr-deletion-sub"
      + project                    = "breatheroute"
      + terraform_labels           = {
          + "app"         = "breatheroute"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + topic                      = "breatheroute-prod-gdpr-deletion"

      + dead_letter_policy {
          + dead_letter_topic     = "projects/breatheroute/topics/breatheroute-prod-dead-letter"
          + max_delivery_attempts = 3
        }

      + expiration_policy {}

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "60s"
        }
    }

  # module.infrastructure.module.pubsub.google_pubsub_subscription.gdpr_export will be created
  + resource "google_pubsub_subscription" "gdpr_export" {
      + ack_deadline_seconds       = 600
      + effective_labels           = {
          + "app"         = "breatheroute"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + id                         = (known after apply)
      + labels                     = {
          + "app"         = "breatheroute"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + message_retention_duration = "86400s"
      + name                       = "breatheroute-prod-gdpr-export-sub"
      + project                    = "breatheroute"
      + terraform_labels           = {
          + "app"         = "breatheroute"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + topic                      = "breatheroute-prod-gdpr-export"

      + dead_letter_policy {
          + dead_letter_topic     = "projects/breatheroute/topics/breatheroute-prod-dead-letter"
          + max_delivery_attempts = 3
        }

      + expiration_policy {}

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "60s"
        }
    }

  # module.infrastructure.module.pubsub.google_pubsub_subscription.webhook_delivery will be created
  + resource "google_pubsub_subscription" "webhook_delivery" {
      + ack_deadline_seconds       = 60
      + effective_labels           = {
          + "app"         = "breatheroute"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + id                         = (known after apply)
      + labels                     = {
          + "app"         = "breatheroute"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + message_retention_duration = "86400s"
      + name                       = "breatheroute-prod-webhook-delivery-sub"
      + project                    = "breatheroute"
      + terraform_labels           = {
          + "app"         = "breatheroute"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + topic                      = "breatheroute-prod-webhook-delivery"

      + dead_letter_policy {
          + dead_letter_topic     = "projects/breatheroute/topics/breatheroute-prod-dead-letter"
          + max_delivery_attempts = 12
        }

      + expiration_policy {}

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "30s"
        }
    }

  # module.infrastructure.module.pubsub.google_pubsub_subscription_iam_member.worker_alert_evaluation will be created
  + resource "google_pubsub_subscription_iam_member" "worker_alert_evaluation" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com"
      + project      = "breatheroute"
      + role         = "roles/pubsub.subscriber"
      + subscription = "breatheroute-prod-alert-evaluation-sub"
    }

  # module.infrastructure.module.pubsub.google_pubsub_subscription_iam_member.worker_gdpr_deletion will be created
  + resource "google_pubsub_subscription_iam_member" "worker_gdpr_deletion" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com"
      + project      = "breatheroute"
      + role         = "roles/pubsub.subscriber"
      + subscription = "breatheroute-prod-gdpr-deletion-sub"
    }

  # module.infrastructure.module.pubsub.google_pubsub_subscription_iam_member.worker_gdpr_export will be created
  + resource "google_pubsub_subscription_iam_member" "worker_gdpr_export" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com"
      + project      = "breatheroute"
      + role         = "roles/pubsub.subscriber"
      + subscription = "breatheroute-prod-gdpr-export-sub"
    }

  # module.infrastructure.module.pubsub.google_pubsub_subscription_iam_member.worker_provider_refresh will be created
  + resource "google_pubsub_subscription_iam_member" "worker_provider_refresh" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com"
      + project      = "breatheroute"
      + role         = "roles/pubsub.subscriber"
      + subscription = "breatheroute-prod-provider-refresh-sub"
    }

  # module.infrastructure.module.pubsub.google_pubsub_subscription_iam_member.worker_webhook_delivery will be created
  + resource "google_pubsub_subscription_iam_member" "worker_webhook_delivery" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com"
      + project      = "breatheroute"
      + role         = "roles/pubsub.subscriber"
      + subscription = "breatheroute-prod-webhook-delivery-sub"
    }

  # module.infrastructure.module.redis.google_redis_instance.main will be created
  + resource "google_redis_instance" "main" {
      + alternative_location_id  = (known after apply)
      + auth_enabled             = false
      + auth_string              = (sensitive value)
      + authorized_network       = "projects/breatheroute/global/networks/breatheroute-prod-vpc"
      + connect_mode             = "DIRECT_PEERING"
      + create_time              = (known after apply)
      + current_location_id      = (known after apply)
      + effective_labels         = {
          + "app"         = "breatheroute"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + host                     = (known after apply)
      + id                       = (known after apply)
      + labels                   = {
          + "app"         = "breatheroute"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + location_id              = (known after apply)
      + maintenance_schedule     = (known after apply)
      + maintenance_version      = (known after apply)
      + memory_size_gb           = 2
      + name                     = "breatheroute-prod-redis"
      + nodes                    = (known after apply)
      + persistence_iam_identity = (known after apply)
      + port                     = (known after apply)
      + project                  = "breatheroute"
      + read_endpoint            = (known after apply)
      + read_endpoint_port       = (known after apply)
      + read_replicas_mode       = (known after apply)
      + redis_version            = "REDIS_7_0"
      + region                   = "europe-west4"
      + replica_count            = (known after apply)
      + reserved_ip_range        = (known after apply)
      + secondary_ip_range       = (known after apply)
      + server_ca_certs          = (known after apply)
      + terraform_labels         = {
          + "app"         = "breatheroute"
          + "environment" = "prod"
          + "managed_by"  = "terraform"
        }
      + tier                     = "STANDARD_HA"
      + transit_encryption_mode  = "DISABLED"

      + maintenance_policy {
          + create_time = (known after apply)
          + update_time = (known after apply)

          + weekly_maintenance_window {
              + day      = "SUNDAY"
              + duration = (known after apply)

              + start_time {
                  + hours   = 4
                  + minutes = 0
                  + nanos   = 0
                  + seconds = 0
                }
            }
        }

      + persistence_config {
          + persistence_mode        = "RDB"
          + rdb_next_snapshot_time  = (known after apply)
          + rdb_snapshot_period     = "ONE_HOUR"
          + rdb_snapshot_start_time = (known after apply)
        }
    }

  # module.infrastructure.module.scheduler.google_cloud_scheduler_job.alert_evaluation will be created
  + resource "google_cloud_scheduler_job" "alert_evaluation" {
      + description = "Daily evaluation of commute alerts"
      + id          = (known after apply)
      + name        = "breatheroute-prod-alert-evaluation"
      + paused      = (known after apply)
      + project     = "breatheroute"
      + region      = "europe-west4"
      + schedule    = "0 5 * * *"
      + state       = (known after apply)
      + time_zone   = "Europe/Amsterdam"

      + pubsub_target {
          + attributes = {
              + "job_type" = "alert_evaluation"
            }
          + data       = "eyJqb2JfdHlwZSI6ImFsZXJ0X2V2YWx1YXRpb24iLCJsb29rYWhlYWRfaG91cnMiOjI0fQ=="
          + topic_name = "projects/breatheroute/topics/breatheroute-prod-alert-evaluation"
        }

      + retry_config {
          + max_backoff_duration = "600s"
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = "60s"
          + retry_count          = 3
        }
    }

  # module.infrastructure.module.scheduler.google_cloud_scheduler_job.alert_evaluation_evening will be created
  + resource "google_cloud_scheduler_job" "alert_evaluation_evening" {
      + description = "Evening evaluation for next-day commute alerts"
      + id          = (known after apply)
      + name        = "breatheroute-prod-alert-evaluation-evening"
      + paused      = (known after apply)
      + project     = "breatheroute"
      + region      = "europe-west4"
      + schedule    = "0 20 * * *"
      + state       = (known after apply)
      + time_zone   = "Europe/Amsterdam"

      + pubsub_target {
          + attributes = {
              + "job_type" = "alert_evaluation"
              + "priority" = "next_day"
            }
          + data       = "eyJqb2JfdHlwZSI6ImFsZXJ0X2V2YWx1YXRpb24iLCJsb29rYWhlYWRfaG91cnMiOjE4LCJwcmlvcml0eSI6Im5leHRfZGF5In0="
          + topic_name = "projects/breatheroute/topics/breatheroute-prod-alert-evaluation"
        }

      + retry_config {
          + max_backoff_duration = "600s"
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = "60s"
          + retry_count          = 3
        }
    }

  # module.infrastructure.module.scheduler.google_cloud_scheduler_job.provider_health_check will be created
  + resource "google_cloud_scheduler_job" "provider_health_check" {
      + description = "Periodic health check of external providers"
      + id          = (known after apply)
      + name        = "breatheroute-prod-provider-health-check"
      + paused      = (known after apply)
      + project     = "breatheroute"
      + region      = "europe-west4"
      + schedule    = "*/15 * * * *"
      + state       = (known after apply)
      + time_zone   = "Europe/Amsterdam"

      + pubsub_target {
          + attributes = {
              + "job_type" = "health_check"
            }
          + data       = "eyJjaGVja19vbmx5Ijp0cnVlLCJqb2JfdHlwZSI6ImhlYWx0aF9jaGVjayJ9"
          + topic_name = "projects/breatheroute/topics/breatheroute-prod-provider-refresh"
        }

      + retry_config {
          + max_backoff_duration = "60s"
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = "10s"
          + retry_count          = 1
        }
    }

  # module.infrastructure.module.scheduler.google_cloud_scheduler_job.provider_refresh will be created
  + resource "google_cloud_scheduler_job" "provider_refresh" {
      + description = "Hourly refresh of air quality and pollen data"
      + id          = (known after apply)
      + name        = "breatheroute-prod-provider-refresh"
      + paused      = (known after apply)
      + project     = "breatheroute"
      + region      = "europe-west4"
      + schedule    = "0 * * * *"
      + state       = (known after apply)
      + time_zone   = "Europe/Amsterdam"

      + pubsub_target {
          + attributes = {
              + "job_type" = "provider_refresh"
            }
          + data       = "eyJqb2JfdHlwZSI6InByb3ZpZGVyX3JlZnJlc2giLCJyZWZyZXNoX2FsbCI6dHJ1ZX0="
          + topic_name = "projects/breatheroute/topics/breatheroute-prod-provider-refresh"
        }

      + retry_config {
          + max_backoff_duration = "300s"
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = "30s"
          + retry_count          = 3
        }
    }

  # module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.api_db_password will be created
  + resource "google_secret_manager_secret_iam_member" "api_db_password" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com"
      + project   = "breatheroute"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "breatheroute-prod-db-password"
    }

  # module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.api_jwt_key will be created
  + resource "google_secret_manager_secret_iam_member" "api_jwt_key" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com"
      + project   = "breatheroute"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "breatheroute-prod-jwt-signing-key"
    }

  # module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.api_luchtmeetnet will be created
  + resource "google_secret_manager_secret_iam_member" "api_luchtmeetnet" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com"
      + project   = "breatheroute"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "breatheroute-prod-luchtmeetnet-api-key"
    }

  # module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.api_ns will be created
  + resource "google_secret_manager_secret_iam_member" "api_ns" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com"
      + project   = "breatheroute"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "breatheroute-prod-ns-api-key"
    }

  # module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.api_pollen will be created
  + resource "google_secret_manager_secret_iam_member" "api_pollen" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com"
      + project   = "breatheroute"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "breatheroute-prod-pollen-api-key"
    }

  # module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.worker_apns will be created
  + resource "google_secret_manager_secret_iam_member" "worker_apns" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com"
      + project   = "breatheroute"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "breatheroute-prod-apns-key"
    }

  # module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.worker_db_password will be created
  + resource "google_secret_manager_secret_iam_member" "worker_db_password" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com"
      + project   = "breatheroute"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "breatheroute-prod-db-password"
    }

  # module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.worker_luchtmeetnet will be created
  + resource "google_secret_manager_secret_iam_member" "worker_luchtmeetnet" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com"
      + project   = "breatheroute"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "breatheroute-prod-luchtmeetnet-api-key"
    }

  # module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.worker_pollen will be created
  + resource "google_secret_manager_secret_iam_member" "worker_pollen" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com"
      + project   = "breatheroute"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "breatheroute-prod-pollen-api-key"
    }

  # module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.worker_webhook will be created
  + resource "google_secret_manager_secret_iam_member" "worker_webhook" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com"
      + project   = "breatheroute"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "breatheroute-prod-webhook-signing-secret"
    }

Plan: 49 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_url                   = (known after apply)
  + cloud_sql_connection_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @michaeldoye, Action: `pull_request`*